In [1]:
import pandas as pd

                            Reporte de calidad poblacion total mundial

In [2]:
data_total_poblacion = pd.read_csv('poblacion_mundial_total.csv')

In [3]:
data_total_poblacion.head()

,"Region, development group, country or area",Notes,Location code,Type of data,1990,1995,2000,2005,2010,2015,2020
0,WORLD,NaN,900,NaN,5 327 231,5 744 213,6 143 494,6 541 907,6 956 824,7 379 797,7 794 799
1,Sub-Saharan Africa,NaN,947,NaN,490 605,560 759,639 661,729 733,836 364,958 577,1 094 366
2,Northern Africa and Western Asia,NaN,1833,NaN,288 060,323 178,355 882,391 986,435 367,481 520,525 869
3,Central and Southern Asia,NaN,921,NaN,1 239 984,1 376 200,1 511 915,1 647 074,1 775 361,1 896 327,2 014 709
4,Eastern and South-Eastern Asia,NaN,1832,NaN,1 837 799,1 950 220,2 044 789,2 125 348,2 201 807,2 279 490,2 346 709

In [4]:
data_total_poblacion.isna().sum()

Region, development group, country or area      0
Notes                                         243
Location code                                   0
Type of data                                   51
1990                                            0
1995                                            0
2000                                            0
2005                                            0
2010                                            0
2015                                            0
2020                                            0
dtype: int64

las columnas Notes y Type of data tiene valores nulos ya que no aportan nada al modelo que se necesita se sugiere dropearlas

In [7]:
print("Numero de columnas:", data_total_poblacion.shape[1])
print("Numero de filas:", data_total_poblacion.shape[0])

Numero de columnas: 11
Numero de filas: 283

In [11]:
for item in data_total_poblacion['Region, development group, country or area'].unique():
    print(item,end='___')
""""
Existen diferentes regiones con un * al final de sus nombre se deberia normalizar dichos nombres eliminando estos caracteres especiales
Eliminar los espacios que estan al comienzo de cada dato en esta columna con el metodo strip()
Normalizar cada dato usando capitalize 
Normalizar la región Dem. People's Republic of Korea a North Korea
Normalizar la región Republic of Korea a solo South
Normalizar China, Macao SAR*, China, Hong Kong SAR*, China* a solo China
Normalizar Taiwan Province of China* a solo Taiwan
Normalizar  Iran (Islamic Republic of) a solo Iran
Normalizar Côte d'Ivoire a Solo Cote d'Ivoire
"""

WORLD___  Sub-Saharan Africa___  Northern Africa and Western Asia___  Central and Southern Asia___  Eastern and South-Eastern Asia___  Latin America and the Caribbean___  Oceania (excluding Australia and New Zealand)___  Australia and New Zealand___  Europe and Northern America___  Developed regions___  Less developed regions___ Less developed regions, excluding least developed countries___ Less developed regions, excluding China___  Least developed countries___  Land-locked Developing Countries (LLDC)___  Small island developing States (SIDS)___  High-income countries___  Middle-income countries___ Upper-middle-income countries___ Lower-middle-income countries___  Low-income countries___ AFRICA___  Eastern Africa___   Burundi___   Comoros___   Djibouti___   Eritrea___   Ethiopia___   Kenya___   Madagascar___   Malawi___   Mauritius*___   Mayotte*___   Mozambique___   Réunion*___   Rwanda___   Seychelles___   Somalia___   South Sudan___   Uganda___   United Republic of Tanzania*___   Zambia___   Zimbabwe___  Middle Africa___   Angola___   Cameroon___   Central African Republic___   Chad___   Congo___   Democratic Republic of the Congo___   Equatorial Guinea___   Gabon___   Sao Tome and Principe___  Northern Africa___   Algeria___   Egypt___   Libya___   Morocco___   Sudan___   Tunisia___   Western Sahara___  Southern Africa___   Botswana___   Eswatini___   Lesotho___   Namibia___   South Africa___  Western Africa___   Benin___   Burkina Faso___   Cabo Verde___   Côte d'Ivoire___   Gambia___   Ghana___   Guinea___   Guinea-Bissau___   Liberia___   Mali___   Mauritania___   Niger___   Nigeria___   Saint Helena*___   Senegal___   Sierra Leone___   Togo___ ASIA___  Central Asia___   Kazakhstan___   Kyrgyzstan___   Tajikistan___   Turkmenistan___   Uzbekistan___  Eastern Asia___   China*___   China, Hong Kong SAR*___   China, Macao SAR*___   China, Taiwan Province of China*___   Dem. People's Republic of Korea___   Japan___   Mongolia___   Republic of Korea___  South-Eastern Asia___   Brunei Darussalam___   Cambodia___   Indonesia___   Lao People's Democratic Republic___   Malaysia*___   Myanmar___   Philippines___   Singapore___   Thailand___   Timor-Leste___   Viet Nam___  Southern Asia___   Afghanistan___   Bangladesh___   Bhutan___   India___   Iran (Islamic Republic of)___   Maldives___   Nepal___   Pakistan___   Sri Lanka___  Western Asia___   Armenia___   Azerbaijan*___   Bahrain___   Cyprus*___   Georgia*___   Iraq___   Israel___   Jordan___   Kuwait___   Lebanon___   Oman___   Qatar___   Saudi Arabia___   State of Palestine*___   Syrian Arab Republic___   Turkey___   United Arab Emirates___   Yemen___ EUROPE___  Eastern Europe___   Belarus___   Bulgaria___   Czechia___   Hungary___   Poland___   Republic of Moldova*___   Romania___   Russian Federation___   Slovakia___   Ukraine*___  Northern Europe___   Channel Islands*___   Denmark*___   Estonia___   Faroe Islands*___   Finland*___   Iceland___   Ireland___   Isle of Man*___   Latvia___   Lithuania___   Norway*___   Sweden___   United Kingdom*___  Southern Europe___   Albania___   Andorra___   Bosnia and Herzegovina___   Croatia___   Gibraltar*___   Greece___   Holy See*___   Italy___   Malta___   Montenegro___   North Macedonia___   Portugal___   San Marino___   Serbia*___   Slovenia___   Spain*___  Western Europe___   Austria___   Belgium___   France*___   Germany___   Liechtenstein___   Luxembourg___   Monaco___   Netherlands*___   Switzerland___ LATIN AMERICA AND THE CARIBBEAN___  Caribbean___   Anguilla*___   Antigua and Barbuda___   Aruba*___   Bahamas___   Barbados___   Bonaire, Sint Eustatius and Saba*___   British Virgin Islands*___   Cayman Islands*___   Cuba___   Curaçao*___   Dominica___   Dominican Republic___   Grenada___   Guadeloupe*___   Haiti___   Jamaica___   Martinique*___   Montserrat*___   Puerto Rico*___   Saint Barthélemy*___   Saint Kitts and Nevis___   Saint Lucia___   Saint Martin (French part)*___   Saint Vincent and the Grenadines___   Sint Maarten (Dutch part)*___   Trinidad and Tobago___   Turks and Caicos Islands*___   United States Virgin Islands*___  Central America___   Belize___   Costa Rica___   El Salvador___   Guatemala___   Honduras___   Mexico___   Nicaragua___   Panama___  South America___   Argentina___   Bolivia (Plurinational State of)___   Brazil___   Chile___   Colombia___   Ecuador___   Falkland Islands (Malvinas)*___   French Guiana*___   Guyana___   Paraguay___   Peru___   Suriname___   Uruguay___   Venezuela (Bolivarian Republic of)___ NORTHERN AMERICA___   Bermuda*___   Canada___   Greenland*___   Saint Pierre and Miquelon*___   United States of America*___ OCEANIA ___   Australia*___   New Zealand*___  Melanesia___   Fiji___   New Caledonia*___   Papua New Guinea___   Solomon Islands___   Vanuatu___  Micronesia___   Guam*___   Kiribati___   Marshall Islands___   Micronesia (Fed. States of)___   Nauru___   Northern Mariana Islands*___   Palau___  Polynesia*___   American Samoa*___   Cook Islands*___   French Polynesia*___   Niue*___   Samoa___   Tokelau*___   Tonga___   Tuvalu___   Wallis and Futuna Islands*___

'"\nExisten diferentes regiones con un * al final de sus nombre se deberia normalizar dichos nombres eliminando estos caracteres especiales\nEliminar los espacios que estan al comienzo de cada dato en esta columna con el metodo strip()\nNormalizar cada dato usando capitalize \nNormalizar la región Dem. People\'s Republic of Korea a North Korea\nNormalizar la región Republic of Korea a solo South\nNormalizar China, Macao SAR*, China, Hong Kong SAR*, China* a solo China\nNormalizar Taiwan Province of China* a solo Taiwan\nNormalizar  Iran (Islamic Republic of) a solo Iran\nNormalizar Côte d\'Ivoire a Solo Cote d\'Ivoire\n'

In [17]:
data_total_poblacion.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 283 entries, 0 to 282
Data columns (total 11 columns):
 #   Column                                      Non-Null Count  Dtype
---  ------                                      --------------  -----
 0   Region, development group, country or area  283 non-null    object
 1   Notes                                       40 non-null     float64
 2   Location code                               283 non-null    int64
 3   Type of data                                232 non-null    object
 4   1990                                        283 non-null    object
 5   1995                                        283 non-null    object
 6   2000                                        283 non-null    object
 7   2005                                        283 non-null    object
 8   2010                                        283 non-null    object
 9   2015                                        283 non-null    object
 10  2020                                        283 non-null    object
dtypes: float64(1), int64(1), object(9)
memory usage: 24.4+ KB

Los valores en los datos de las columnas anios deberian cambiar de tipo object a float

                                Reporte de calidad destino total de inmigrantes

In [18]:
data_total_destino = pd.read_csv('destino_total_inmigrantes.csv')

In [19]:
data_total_destino.head()

,"Region, development group, country or area",Notes,Location code,Type of data,1990,1995,2000,2005,2010,2015,2020
0,WORLD,NaN,900,NaN,152 986 157,161 289 976,173 230 585,191 446 828,220 983 187,247 958 644,280 598 105
1,Sub-Saharan Africa,NaN,947,NaN,13 286 341,14 275 437,13 151 229,14 290 369,15 854 637,20 721 874,22 221 538
2,Northern Africa and Western Asia,NaN,1833,NaN,17 608 769,18 912 064,20 321 397,23 165 804,32 638 434,42 036 092,49 767 746
3,Central and Southern Asia,NaN,921,NaN,26 168 623,21 247 814,20 139 825,18 854 544,19 676 783,19 266 265,19 427 576
4,Eastern and South-Eastern Asia,NaN,1832,NaN,6 835 882,8 339 806,10 506 212,12 979 157,15 760 463,18 027 810,19 591 106

In [20]:
data_total_destino.isna().sum()

Region, development group, country or area      0
Notes                                         243
Location code                                   0
Type of data                                   51
1990                                            0
1995                                            0
2000                                            0
2005                                            0
2010                                            0
2015                                            0
2020                                            0
dtype: int64

Dropear las columnas Notes y type of data ya que no son necesarias y ademas tienen valores nulos

In [21]:
data_total_destino[data_total_destino.duplicated()]

,"Region, development group, country or area",Notes,Location code,Type of data,1990,1995,2000,2005,2010,2015,2020
256,Australia and New Zealand,NaN,927,NaN,4 473 260,4 741 947,5 065 063,5 717 982,6 830 423,7 769 466,9 067 584

In [23]:
data_total_destino[data_total_destino['Region, development group, country or area']  == '  Australia and New Zealand' ]

,"Region, development group, country or area",Notes,Location code,Type of data,1990,1995,2000,2005,2010,2015,2020
7,Australia and New Zealand,NaN,927,NaN,4 473 260,4 741 947,5 065 063,5 717 982,6 830 423,7 769 466,9 067 584
256,Australia and New Zealand,NaN,927,NaN,4 473 260,4 741 947,5 065 063,5 717 982,6 830 423,7 769 466,9 067 584

Se sugiere dropear alguna de estas filas ya que estan duplicados

In [24]:
data_total_destino.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 283 entries, 0 to 282
Data columns (total 11 columns):
 #   Column                                      Non-Null Count  Dtype
---  ------                                      --------------  -----
 0   Region, development group, country or area  283 non-null    object
 1   Notes                                       40 non-null     float64
 2   Location code                               283 non-null    int64
 3   Type of data                                232 non-null    object
 4   1990                                        283 non-null    object
 5   1995                                        283 non-null    object
 6   2000                                        283 non-null    object
 7   2005                                        283 non-null    object
 8   2010                                        283 non-null    object
 9   2015                                        283 non-null    object
 10  2020                                        283 non-null    object
dtypes: float64(1), int64(1), object(9)
memory usage: 24.4+ KB

Cambiar las columnas años de tipo object a tipo float

Normalizar la columna Region, development group, country or area como en el dataframe anterior

                                Reporte de calidad del dato para el dataset Origen total emigrantes

In [25]:
data_origen_emigrantes = pd.read_csv('origen_total_emigrantes.csv')

In [26]:
data_origen_emigrantes.head()

,"Region, development group, country or area",Location code,1990,1995,2000,2005,2010,2015,2020
0,WORLD,900,152 986 157,161 289 976,173 230 585,191 446 828,220 983 187,247 958 644,280 598 105
1,Sub-Saharan Africa,947,15 334 807,16 488 973,15 638 014,17 274 985,19 942 724,24 197 211,28 284 538
2,Northern Africa and Western Asia,1833,16 365 218,18 069 437,19 437 054,21 867 791,25 313 711,32 606 047,37 563 820
3,Central and Southern Asia,921,31 104 020,29 069 983,30 897 694,33 347 690,41 082 388,46 481 130,51 229 549
4,Eastern and South-Eastern Asia,1832,14 774 419,17 860 923,21 440 854,25 556 983,30 977 206,35 205 590,38 400 740

In [27]:
data_origen_emigrantes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 284 entries, 0 to 283
Data columns (total 9 columns):
 #   Column                                      Non-Null Count  Dtype
---  ------                                      --------------  -----
 0   Region, development group, country or area  284 non-null    object
 1   Location code                               284 non-null    int64
 2   1990                                        284 non-null    object
 3   1995                                        284 non-null    object
 4   2000                                        284 non-null    object
 5   2005                                        284 non-null    object
 6   2010                                        284 non-null    object
 7   2015                                        284 non-null    object
 8   2020                                        284 non-null    object
dtypes: int64(1), object(8)
memory usage: 20.1+ KB

Las columnas años que van desde 1990 hasta 2020 cada 5 años se debe cambiar su tipo de object a float

In [28]:
data_origen_emigrantes.isna().sum()

Region, development group, country or area    0
Location code                                 0
1990                                          0
1995                                          0
2000                                          0
2005                                          0
2010                                          0
2015                                          0
2020                                          0
dtype: int64

Este dataset no contiene valores nulos

In [29]:
data_origen_emigrantes[data_origen_emigrantes.duplicated()]

,"Region, development group, country or area",Location code,1990,1995,2000,2005,2010,2015,2020
256,Australia and New Zealand,927,689 030,758 234,871 660,984 280,1 149 265,1 256 202,1 404 924

In [30]:
data_origen_emigrantes[data_origen_emigrantes['Region, development group, country or area'] == '  Australia and New Zealand']

,"Region, development group, country or area",Location code,1990,1995,2000,2005,2010,2015,2020
7,Australia and New Zealand,927,689 030,758 234,871 660,984 280,1 149 265,1 256 202,1 404 924
256,Australia and New Zealand,927,689 030,758 234,871 660,984 280,1 149 265,1 256 202,1 404 924

Eliminar alguno de estos duplicados
 
Normalizar la columna Region, development group, country or area eliminar caracteres especiales y el mismo tratamiento sugerido en el primer dataset